app/controllers/password_resets_controller.rb

  def create
    @user = User.find_by(email: params[:password_reset][:email].downcase)
---
SELECT  `users`.* FROM `users`  WHERE `users`.`email` = 'mathias@orange.sn' LIMIT 1

  def update
    if both_passwords_blank?
      flash.now[:danger] = "Password/confirmation can't be blank"
      render 'edit'
    elsif @user.update_attributes(user_params)
---
UPDATE `users` SET `password_digest` = '$2a$10$NAPNDbIO9Exjinbx2AgJTOJoScd2oXc0XQDNumdNU8yuZ6YoANQHW', `updated_at` = '2014-12-25 14:35:10' WHERE `users`.`id` = 101