app/controllers/users_controller.rb

SELECT  `users`.* FROM `users`  LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `users`
---
  def index
    @users = User.paginate(page: params[:page])

INSERT INTO `users` (`activation_digest`, `created_at`, `email`, `image`, `name`, `password_digest`, `updated_at`) VALUES ('$2a$10$NJ36cPXOn2OAWnW4He1omOt1nf3BtfRji9A/0HbhMnJIMD.JRzepW', '2014-12-18 20:13:39', 'toure@exemple.org', '4.jpg', 'toure', '$2a$10$W045PkvO5i7g1TbL2tr6b..2Va5gajohWjzYLPwH7i00TldSGFG5.', '2014-12-18 20:13:39')
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `image` = 'sira.jpg', `updated_at` = '2014-12-17 15:20:14' WHERE `users`.`id` = 7
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)